var itemList = [
    {
        "id": 1,
        "items": [{
            "id": 1001,
            "name": "张三1"
        },
            {
                "id": 1002,
                "name": "李四1"
            },
            {
                "id": 1003,
                "name": "王五1"
            },
            {
                "id": 1004,
                "name": "赵六1"
            },
            {
                "id": 1005,
                "name": "赵七1"
            }],
        "name": "我的同学"
    },
    {
        "id": 2,
        "items": [{
            "id": 1001,
            "name": "张三2"
        },
            {
                "id": 1002,
                "name": "李四2"
            },
            {
                "id": 1003,
                "name": "王五2"
            },
            {
                "id": 1004,
                "name": "赵六2"
            },
            {
                "id": 1005,
                "name": "赵七2"
            }],
        "name": "我的同事"
    },
    {
        "id": 3,
        "items": [{
            "id": 1001,
            "name": "张三2"
        },
            {
                "id": 1002,
                "name": "李四2"
            },
            {
                "id": 1003,
                "name": "王五2"
            },
            {
                "id": 1004,
                "name": "赵六2"
            },
            {
                "id": 1005,
                "name": "赵七2"
            }],
        "name": "我的"
    }
]